{
    "Experience": "Töökogemus",
    "Product Design Intern": "Tootedisaini praktikant",
    "Restaurant Manager": "Restorani juhataja",
    "Restaurant Kaerajaan": "Restoran Kaerajaan",
    "Responsible for running a fast-paced restaurant in Tallinn Town Hall Square": "Kiireloomulise Raekoja platsi restorani juhtimine",
    "Software Engineer": "Tarkvaraarendaja",
    "now": "tänaseni",
    "Oct": "okt",
    "Nov": "nov",
    "Jan": "jaan",
    "Dec": "dets",
    "Feb": "veebr",
    "Education": "Haridus",
    "Skills for becoming Full Stack Developer": "Full Stack arendaja oskuste omandamine",
    "University of Tartu": "Tartu Ülikool",
    "Psychology Major (Social sciences)": "Psühholoogia Bakalaureus (Sotsiaalteadused)",
    "Final Thesis": "Lõputöö",
    "Tallinn French School": "Tallinna Prantsuse Lütseum",
    "Primary and Secondary school": "Põhi-ja keskharidus",
    "Additional Courses": "Lisakursused",
    "UX Estonia Course Certificate": "UX Estonia UX disaini kursus",
    "Certificate": "Tunnistus",
    "Javascript & React Course Certificate": "Javascript & React - nullist spetsialistiks intensiivkursus",
    "Projects": "Projektid",
    "Grow Finance Power BI dashboard": "Grow ärianalüütika platvorm",
    "During the internship in Grow Solutions, we launched a business intelligence product for business owners and executives.": "Grow Solutions praktika raames arendasime välja Power BI-l tugineva ärianalüütika platvormi.",
    "My contribution was to design and build the overall layout. While Power BI has limitations in design flexibility, its power and accessibility make it a strong and practical choice for data visualization.": "Minu töö oli platvorm disainida ja kokku panna.",
    "LLM prompting best practices": "Kuidas suhelda tehisaruga?",
    "Presentation for Jõhvi Gümnaasium on the context and best practices of LLMs. Utilized": "Esitlus Jõhvi Gümnaasiumi õpetajatele ja abiturientidele keelemudelite kasutamise parimate tavade kohta. Kasutasin",
    "for creating the presentation. A powerful presentation tool for developers.": "esitluse loomiseks. Suurepärane esitluste tegemise tööriist arendajatele.",
    "Article about the event": "Ilmunud artikkel ürituse kohta",
    "Aurelius legal services website": "Aurelius õigusabi koduleht",
    "My first full-stack project, made with React.": "Ehitatud Reactiga, esimene ametlikult lansseeritud veebiprojekt.",
    "article on Wise Interventions (in Estonian)": "artikli teemal 'Wise Interventions'",
    "A cousin to 'nudging,' wise interventions target core beliefs to foster lasting changes in behavior and well-being. Small yet crucial shifts in perspective hold the potential for profound, cumulative impact.": "'Müksamise' sugulane, 'Wise Interventions' on praktiline psühholoogiliste muutuste esile kutsumise raamistik.",
    "Psychology": "Psühholoogia",
    "Behavioural Economics": "Käitumisökonoomika",
    "Developing a platform for creating, managing and monitoring sports tournaments.": "Arendame Eesti Lauatennise Liidule veebilehte ja platvormi võistluste läbi viimiseks ja jälgimiseks.",
    "Building the frontend with a modern React stack, including Tanstack Router and Tanstack Query.": "Minu töö on ehitada Reactil põhinev kasutajaliides kasutades modernseid frontend tehnoloogiaid nagu Tanstack Query ja Tanstack Router.",
    "Managing design system in Figma to ensure consistent UI.": "Figmas disainisüsteemi loomine ja haldamine ühtlase stiili tagamiseks.",
    "Developed a financial dashboard for CEOs to monitor cash flow and critical business metrics.": "Arendasime toote firma juhtidele ja finantsinimestele rahavoo ja muude oluliste ärinäitajate jälgimiseks.",
    "Collaborated with a team (data engineer, financial analyst) to define product requirements and optimize user experience.": "Koostöös andmeinseneri ja finantsanalüütikuga määrasime toote nõuded ja optimeerisime kasutajakogemuse.",
    "Leveraged Power BI template apps to create a reusable template.": "Kasutasime Power BI Template App'i taaskasutatava raami loomiseks.",
    "Managed daily operations of a 150-seat restaurant in Tallinn Old Town.": "Juhtisin Tallinna Raekoja platsil asuva 150-kohalise restorani igapäevast tööd.",
    "Maintained smooth operations between kitchen and service teams": "Tagasin sujuva koostöö köögi- ja teenindusmeeskonna vahel.",
    "Created marketing materials and job listings.": "Koostasin turundusmaterjale ja viisin läbi tööintervjuusid.",
    "Developing multiple API servers and backend tools in Go.": "Arendamas API-servereid ja muid tööriistu põhiliselt Golangi, Javascripti ja Pythoniga.",
    "Building client applications with Typescript.": "Ehitan kasutajaliideseid TypeScripti ja Reactiga.",
    "Collaborating in teams on large-scale development projects.": "Arendame tiimides suuremahulisi projekte, pidades silmas tarkvaraarenduse parimaid praktikaid.",
    "Focused on cognitive psychology and behavioural economics.": "Põhiline uurimishuvi kognitiivse psühholoogia ja käitumisökonoomika vastu.",
    "Wrote an": "Kirjutasin",
    "for general public.": "",
    "investigates human decision-making through eye-tracking.": "uurib inimeste otsustusprotsesse silmaseire abil",
    "Tech Stack": "Tehnoloogiad",
    "Programming languages": "Programmeerimiskeeled",
    "Languages": "Keeled",
    "Frontend development": "Frontend arendus",
    "Databases": "Andmebaasid",
    "Workflow tools": "Muud tööriistad",
    "English": "inglise",
    "Estonian": "eesti",
    "Russian": "vene",
    "French": "prantsuse",
    "Other": "Muu",
    "freelance web project": "esimene tõeline veebiprojekt",
    "LLM prompting presentation for Jõhvi Gümnaasium": "Keelemudelite promptimise parimate tavade esitlus Jõhvi Gümnaasiumile",
    "LLM prompting presentation for Kood/Jõhvi sprinters": "Esitlus Keelemudelite kasutamisest õppimisel Kood/Jõhvi sprinteritele"
}